src/sampleXmlData.xml

<!--SOAP REQUEST-->

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Header>
    <To xmlns="http://www.w3.org/2005/08/addressing">http://black:8080/peering/WSDBASoapService</To>
    <Action xmlns="http://www.w3.org/2005/08/addressing">http://www.whitespace-db-providers.org/2011//InterDB/ws/RealTimePoll</Action>
    <ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
      <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
    </ReplyTo>
    <MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:7536913d-f76e-4f58-bf6b-8214bfe006d2</MessageID>
  </S:Header>
  <S:Body>
    <ns3:RealTimePoll xmlns:ns2="http://www.whitespace-db-providers.org/2011//InterDB/ws" xmlns:ns3="http://whitespace.keybridgeglobal.com/peering/wsdba" xmlns:ns4="http://www.whitespace-db-providers.org/2011//InterDB/ws/RealTimePoll">
      <RealTimePollRequest>
        <ns2:RequestedTransactionID>1369840222065</ns2:RequestedTransactionID>
        <ns2:Command>wsdPoll</ns2:Command>
        <ns2:XsdVersion>V12</ns2:XsdVersion>
      </RealTimePollRequest>
    </ns3:RealTimePoll>
  </S:Body>
</S:Envelope>

<!--SOAP RESPONSE-->

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:wsc="http://schemas.xmlsoap.org/ws/2005/02/sc" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:xs="http://www.w3.org/2001/XMLSchema">
  <S:Header>
    <Action xmlns="http://www.w3.org/2005/08/addressing" S:mustUnderstand="1" wsu:Id="_5004">http://whitespace.keybridgeglobal.com/peering/wsdba/WSDBASoapService/RealTimePollResponse</Action>
    <MessageID xmlns="http://www.w3.org/2005/08/addressing" wsu:Id="_5003">uuid:0440969d-3001-4ea3-8d1e-b589b85746be</MessageID>
    <RelatesTo xmlns="http://www.w3.org/2005/08/addressing" wsu:Id="_5005">uuid:7536913d-f76e-4f58-bf6b-8214bfe006d2</RelatesTo>
    <To xmlns="http://www.w3.org/2005/08/addressing" wsu:Id="_5006">http://www.w3.org/2005/08/addressing/anonymous</To>
  </S:Header>
  <S:Body wsu:Id="_5007">
    <ns4:RealTimePollResponse xmlns:ns4="http://www.whitespace-db-providers.org/2011//InterDB/ws/RealTimePoll">
      <return>
        <ns2:RequestedTransactionID xmlns:ns2="http://www.whitespace-db-providers.org/2011//InterDB/ws">1369840222065</ns2:RequestedTransactionID>
        <ns2:Command xmlns:ns2="http://www.whitespace-db-providers.org/2011//InterDB/ws">wsdPollResponse</ns2:Command>
        <ns2:RegistrationRecordEnsemble xmlns:ns2="http://www.whitespace-db-providers.org/2011//InterDB/ws">&lt;?xml version="1.0" encoding="UTF-8" standalone="yes"?&gt;
&lt;RegistrationRecordEnsemble version="V12" xmlns:ns2="urn:ietf:params:xml:ns:vcard-4.0" xmlns="http://www.whitespace-db-providers.org/2011//InterDB/xsd" xmlns:ns4="http://www.w3.org/1999/xlink" xmlns:ns3="http://www.opengis.net/gml" xmlns:ns5="urn:ietf:params:xml:ns:icalendar-2.0" xmlns:ns6="http://www.w3.org/2000/09/xmldsig#" xmlns:ns7="http://www.w3.org/2001/SMIL20/" xmlns:ns8="http://www.w3.org/2001/SMIL20/Language"&gt;
    &lt;EnsembleDescription&gt;
        &lt;Registrar&gt;KEYB&lt;/Registrar&gt;
        &lt;GenerationDate&gt;2013-05-29T15:10:24.375Z&lt;/GenerationDate&gt;
        &lt;Scope&gt;INC&lt;/Scope&gt;
        &lt;RecordsFrom&gt;2013-05-29T15:10:24.375Z&lt;/RecordsFrom&gt;
        &lt;RecordsTo&gt;2013-05-29T15:10:24.375Z&lt;/RecordsTo&gt;
    &lt;/EnsembleDescription&gt;
&lt;/RegistrationRecordEnsemble&gt;
        </ns2:RegistrationRecordEnsemble>
        <ns2:XsdVersion xmlns:ns2="http://www.whitespace-db-providers.org/2011//InterDB/ws">V12</ns2:XsdVersion>
        <ns2:NextTransactionID xmlns:ns2="http://www.whitespace-db-providers.org/2011//InterDB/ws">1369840524372</ns2:NextTransactionID>
        <ns2:RT-PollStatusCode xmlns:ns2="http://www.whitespace-db-providers.org/2011//InterDB/ws">4</ns2:RT-PollStatusCode>
      </return>
    </ns4:RealTimePollResponse>
  </S:Body>
</S:Envelope>

<!--SOAP RESPONSE MESSAGE CONTENT (FROM ABOVE, CLEANED UP FOR READING)-->

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<RegistrationRecordEnsemble version="V12" xmlns:ns2="urn:ietf:params:xml:ns:vcard-4.0" xmlns="http://www.whitespace-db-providers.org/2011//InterDB/xsd" xmlns:ns4="http://www.w3.org/1999/xlink" xmlns:ns3="http://www.opengis.net/gml" xmlns:ns5="urn:ietf:params:xml:ns:icalendar-2.0" xmlns:ns6="http://www.w3.org/2000/09/xmldsig#" xmlns:ns7="http://www.w3.org/2001/SMIL20/" xmlns:ns8="http://www.w3.org/2001/SMIL20/Language">
  <EnsembleDescription>
    <Registrar>KEYB</Registrar>
    <GenerationDate>2013-05-29T15:10:24.375Z</GenerationDate>
    <Scope>INC</Scope>
    <RecordsFrom>2013-05-29T15:10:24.375Z</RecordsFrom>
    <RecordsTo>2013-05-29T15:10:24.375Z</RecordsTo>
  </EnsembleDescription>
</RegistrationRecordEnsemble>